In [1]:
import os
import mysql.connector
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
my_db = mysql.connector.connect(
host = 'localhost',
user = 'root',
password = 'Assie@225',
db = 'girrafe' 
)

In [3]:
my_db

In [4]:
data_tables = pd.read_sql_query('SHOW TABLES FROM girrafe',my_db)

In [5]:
data_tables

  Tables_in_girrafe
0            branch
1   branch_supplier
2            client
3          Employee
4      trigger_test
5         work_with

In [6]:
serie_tables = data_tables['Tables_in_girrafe']

In [7]:
for table in serie_tables:
    output = pd.read_sql_query('DESCRIBE {}'.format(table), my_db)
    print(table)
    print(output,'\n')

branch
            Field            Type Null  Key Default Extra
0       branch_id          b'int'   NO  PRI    None
1     branch_name  b'varchar(40)'  YES         None
2          mgr_id          b'int'  YES  MUL    None
3  mgr_start_date         b'date'  YES         None

branch_supplier
           Field            Type Null  Key Default Extra
0      branch_id          b'int'   NO  PRI    None
1  supplier_name  b'varchar(40)'   NO  PRI    None
2    supply_type  b'varchar(40)'  YES         None

client
         Field            Type Null  Key Default Extra
0    client_id          b'int'   NO  PRI    None
1  client_name  b'varchar(40)'  YES         None
2    branch_id          b'int'  YES  MUL    None

Employee
        Field            Type Null  Key Default Extra
0      emp_id          b'int'   NO  PRI    None
1  first_name  b'varchar(40)'  YES         None
2   last_name  b'varchar(40)'  YES         None
3  birth_date         b'date'  YES         None
4         sex   b'varchar(1)'  YES         None
5      salary          b'int'  YES         None
6    super_id          b'int'  YES  MUL    None
7   branch_id          b'int'  YES  MUL    None

trigger_test
     Field             Type Null Key Default Extra
0  message  b'varchar(100)'  YES        None

work_with
         Field    Type Null  Key Default Extra
0       emp_id  b'int'   NO  PRI    None
1    client_id  b'int'   NO  PRI    None
2  total_sales  b'int'  YES         None

In [13]:
db = mysql.connector.connect(
host = 'localhost',
user = 'root',
password = 'Assie@225'
)

In [14]:
db

# Check Databases

# Step1

In [18]:

# Create a pointer called cursor

my_cursor = db.cursor()

In [16]:
my_cursor.execute('SHOW DATABASES')

In [23]:
for x in my_cursor:
    print(x)

# Step2
### how to create a __DATABASE__?

In [20]:
## After the connection

my_cursor = db.cursor()

In [21]:
my_cursor.execute('CREATE DATABASE database1')

In [24]:
my_cursor.execute('SHOW DATABASES')

In [25]:
for x in my_cursor:
    print(x)

('database1',)
('girrafe',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

# Step3 

### How to create a __TABLE__ ?

In [26]:
# How to create table. Mention the database where you want create table inside

db = mysql.connector.connect(
host = 'localhost',
user = 'root',
password = 'Assie@225',
database = 'database1'    
)

In [27]:
my_cursor = db.cursor()

In [28]:
my_cursor.execute(
    'CREATE TABLE marks(gender VARCHAR(6), student_id INT(10),marks INT(3))')

In [29]:
my_cursor.execute('SHOW TABLES')

In [30]:
for x in my_cursor:
    print(x)

('marks',)

# Step4


### How to insert records into the table __(1)__

#### __Single__ record insertion.

In [32]:
 sql = "INSERT INTO marks (gender,student_id,marks) VALUES('female',200,67)"

In [34]:
my_cursor.execute(sql)
db.commit()

In [35]:
print(my_cursor.rowcount,'record inserted')

1 record inserted

### __Multiple__ record insertion __(2)__

In [36]:
 sql = "INSERT INTO marks (gender,student_id,marks) VALUES('female',201,70),('male',202,65),('female',203,77),('female',204,66)"

In [37]:
my_cursor.execute(sql)
db.commit()

In [38]:
print(my_cursor.rowcount,'record inserted')

4 record inserted

In [41]:
ls

README.md      live1.ipynb    sql_data.csv
YouTube.ipynb  sql.ipynb      untitled.txt

In [42]:
today_data = pd.read_csv('sql_data.csv')

In [43]:
today_data.head()

   gender  student_id  marks
0    male         100     50
1  female         200     67
2  female         201     70
3    male         202     65
4  female         203     77

### __Multiple__ record insertion __(2.1)__

### Another to insert multiple records
## Using __executemany(a, b)__ take two arguments

In [45]:
sql = "INSERT INTO marks (gender,student_id,marks) VALUES(%s, %s, %s)"
## number of columns must be equal to number %s

In [46]:
value = (('male',205,55),('male',206,59),('male',207,80))

In [47]:
my_cursor.executemany(sql, value)
db.commit()

In [49]:
print(my_cursor.rowcount, 'row inserted')

3 row inserted